app/Controllers/Transaksi/Pengeluaran.php

SELECT *
FROM `tb_pengeluaran`
---
    public function index()
    {
        $db = db_connect();
        $builder = $db->table('tb_pengeluaran');
        $pengeluaran = $builder->get();