app/Controllers/Data/Barang.php

    public function index()
    {
        $db = db_connect();
        $builder = $db->table('view_total_barang');
        $builder->join('tb_kategori_barang', 'tb_kategori_barang.id_kategori_barang = view_total_barang.id_kategori_barang');
        $builder->join('tb_jenis_barang', 'tb_jenis_barang.id_jenis_barang = view_total_barang.id_jenis_barang');
        $builder->join('tb_satuan_barang', 'tb_satuan_barang.id_satuan_barang = view_total_barang.id_satuan_barang');
        $barang = $builder->get();


        $db = db_connect();
        $builder = $db->table('tb_jenis_barang');
        $jenis_barang = $builder->get();

        $db = db_connect();
        $builder = $db->table('tb_kategori_barang');
        $kategori_barang = $builder->get();

        $db = db_connect();
        $builder = $db->table('tb_satuan_barang');
        $satuan_barang = $builder->get();

        $db = db_connect();
        $builder = $db->table('tb_barang');
        $builder->selectMax('kode_barang');
        $query_kode_barang = $builder->get();
---
SELECT *
FROM `view_total_barang`
JOIN `tb_kategori_barang` ON `tb_kategori_barang`.`id_kategori_barang` = `view_total_barang`.`id_kategori_barang`
JOIN `tb_jenis_barang` ON `tb_jenis_barang`.`id_jenis_barang` = `view_total_barang`.`id_jenis_barang`
JOIN `tb_satuan_barang` ON `tb_satuan_barang`.`id_satuan_barang` = `view_total_barang`.`id_satuan_barang`
SELECT *
FROM `tb_jenis_barang`
SELECT *
FROM `tb_kategori_barang`
SELECT *
FROM `tb_satuan_barang`
SELECT MAX(`kode_barang`) AS `kode_barang`
FROM `tb_barang`