app/Controllers/Data/Stok_barang.php

SELECT *
FROM `tb_barang`
JOIN `tb_kategori_barang` ON `tb_kategori_barang`.`id_kategori_barang` = `tb_barang`.`id_kategori_barang`
JOIN `tb_jenis_barang` ON `tb_jenis_barang`.`id_jenis_barang` = `tb_barang`.`id_jenis_barang`
JOIN `tb_satuan_barang` ON `tb_satuan_barang`.`id_satuan_barang` = `tb_barang`.`id_satuan_barang`
WHERE `kode_barang` = 'BRG0003'
SELECT *
FROM `tb_stok_barang`
JOIN `tb_barang` ON `tb_barang`.`id_barang` = `tb_stok_barang`.`id_barang`
JOIN `tb_kategori_barang` ON `tb_kategori_barang`.`id_kategori_barang` = `tb_barang`.`id_kategori_barang`
JOIN `tb_jenis_barang` ON `tb_jenis_barang`.`id_jenis_barang` = `tb_barang`.`id_jenis_barang`
JOIN `tb_satuan_barang` ON `tb_satuan_barang`.`id_satuan_barang` = `tb_barang`.`id_satuan_barang`
WHERE `kode_barang` = 'BRG0003'
SELECT *
FROM `tb_jenis_barang`
SELECT *
FROM `tb_kategori_barang`
SELECT *
FROM `tb_satuan_barang`
---
    public function index($kode_barang)
    {
        $db = db_connect();
        $builder = $db->table('tb_barang');
        $builder->join('tb_kategori_barang', 'tb_kategori_barang.id_kategori_barang = tb_barang.id_kategori_barang');
        $builder->join('tb_jenis_barang', 'tb_jenis_barang.id_jenis_barang = tb_barang.id_jenis_barang');
        $builder->join('tb_satuan_barang', 'tb_satuan_barang.id_satuan_barang = tb_barang.id_satuan_barang');
        $builder->where(array('kode_barang' => $kode_barang));
        $barang = $builder->get();

        $db = db_connect();
        $builder = $db->table('tb_stok_barang');
        $builder->join('tb_barang', 'tb_barang.id_barang = tb_stok_barang.id_barang');
        $builder->join('tb_kategori_barang', 'tb_kategori_barang.id_kategori_barang = tb_barang.id_kategori_barang');
        $builder->join('tb_jenis_barang', 'tb_jenis_barang.id_jenis_barang = tb_barang.id_jenis_barang');
        $builder->join('tb_satuan_barang', 'tb_satuan_barang.id_satuan_barang = tb_barang.id_satuan_barang');
        $builder->where(array('kode_barang' => $kode_barang));
        $stok_barang = $builder->get();
        // var_dump($db->getLastQuery());exit();

        $db = db_connect();
        $builder = $db->table('tb_jenis_barang');
        $jenis_barang = $builder->get();

        $db = db_connect();
        $builder = $db->table('tb_kategori_barang');
        $kategori_barang = $builder->get();

        $db = db_connect();
        $builder = $db->table('tb_satuan_barang');
        $satuan_barang = $builder->get();

SELECT MAX(`kode_barang`) AS `kode_barang`
FROM `tb_barang`
---
        $db = db_connect();
        $builder = $db->table('tb_barang');
        $builder->selectMax('kode_barang');
        $query_kode_barang = $builder->get();