app/Controllers/Login.php

    public function proses()
    {

        $session = session();

        $username = $this->request->getPost('username') ?? '';
        $password = $this->request->getPost('password') ?? '';

        $db = db_connect();
        $builder = $db->table('tb_user');
        $builder->where('username', $username);
        $query = $builder->get();
---
SELECT *
FROM `tb_user`
WHERE `username` = 'admintoko'