app/Controllers/Pages.php

    public function index()
    {
        $db = db_connect();
        $builder = $db->table('tb_transaksi');
        $builder->selectSum('jumlah_harus_bayar');
        $q_trans = $builder->get();


        $builder = $db->table('tb_pengeluaran');
        $builder->selectSum('biaya_pengeluaran');
        $q_pengeluaran = $builder->get();

        $builder = $db->table('tb_barang');
        $q_barang = $builder->get();
---
SELECT SUM(`jumlah_harus_bayar`) AS `jumlah_harus_bayar`
FROM `tb_transaksi`
SELECT SUM(`biaya_pengeluaran`) AS `biaya_pengeluaran`
FROM `tb_pengeluaran`
SELECT *
FROM `tb_barang`