app/Views/home.php

SELECT *
FROM `tb_transaksi`
SELECT *
FROM `tb_pengeluaran`
---
use App\Models\Pengeluaran;
use App\Models\Transaksi;
$transaksiModel = new Transaksi();
$transaksi = $transaksiModel->findAll();
// $transaksi = $transaksiModel->orderBy('id_transaksi', 'DESC')->limit(7)->findAll();

$pengeluaranModel = new Pengeluaran();
$pengeluaran = $pengeluaranModel->findAll();